app/views/book_comments/_book_comment.html.erb

         <td>
            <%= book_comment.created_at.strftime('%Y/%m/%d') %>
---
INSERT INTO "book_comments" ("comment", "user_id", "book_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["comment", "ta"], ["user_id", 1], ["book_id", 1], ["created_at", "2020-05-10 06:18:10.350130"], ["updated_at", "2020-05-10 06:18:10.350130"]]