app/controllers/book_comments_controller.rb

	def create
		#対象のbookの情報を取得
		@book = Book.find(params[:book_id])
		#コメントはログインしているユーザがするよ。空のモデルを作る事でコメントの情報が入るよ。
		@book_comment = current_user.book_comments.new(book_comment_params)
		#コメントは何に対してするの？　＝　本に対してだよ。
		@book_comment.book_id = @book.id
		#コメントをセーブするよ
		@book_comment.save
		   # redirect_to book_path(@book.id)
		flash[:success] = "Comment was successfully created."
		@book_comments = BookComment.where(book_id: @book.id)
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "book_comments" ("comment", "user_id", "book_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["comment", "コメ"], ["user_id", 1], ["book_id", 1], ["created_at", "2020-05-09 10:30:07.442293"], ["updated_at", "2020-05-09 10:30:07.442293"]]
SELECT "book_comments".* FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 1]]

	def destroy
		@book_comment = BookComment.find(params[:book_id])
		@book = @book_comment.book
		@book_comment.user == current_user
		@book_comment.destroy
---
SELECT  "book_comments".* FROM "book_comments" WHERE "book_comments"."id" = ? LIMIT ?  [["id", 18], ["LIMIT", 1]]
DELETE FROM "book_comments" WHERE "book_comments"."id" = ?  [["id", 2]]