app/controllers/favorites_controller.rb

	def create
		@book = Book.find(params[:book_id])
		favorite = current_user.favorites.build(book_id: params[:book_id])
		favorite.save
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "favorites" ("user_id", "book_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["book_id", 1], ["created_at", "2020-05-09 01:26:11.624086"], ["updated_at", "2020-05-09 01:26:11.624086"]]

	def destroy
		#ビューを呼び出す必要がある際、@を使用。
		#destory後、他のページ、アクションでリダイレクトするときはそのアクション内容が呼び出されるからいらない
		@book = Book.find(params[:book_id])
		favorite = Favorite.find_by(book_id: params[:book_id],user_id: current_user.id)
		favorite.destroy
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "favorites".* FROM "favorites" WHERE "favorites"."book_id" = ? AND "favorites"."user_id" = ? LIMIT ?  [["book_id", 1], ["user_id", 1], ["LIMIT", 1]]
DELETE FROM "favorites" WHERE "favorites"."id" = ?  [["id", 62]]